_posts/2022-05-07-bootstrapping-a-jekyll-based-blog.html
---
layout: post
title: Bootstrapping a Jekyll-based Blog
tags: [blogging, github-pages, jekyll]
---
<link rel="stylesheet" type="text/css" href="/assets/main.css" />
<link rel="stylesheet" type="text/css" href="/_orgcss/site.css" />
<div id="outline-container-orgf4dffec" class="outline-2">
<h2 id="orgf4dffec">About</h2>
<div class="outline-text-2" id="text-orgf4dffec">
<p>
This is a guide on how I bootstrapped my own Jekyll blog on GitHub pages.
I took some tips from <a href="http://justinhj.github.io/2020/03/08/how-to-blog-with-org-mode.html">Justin</a> (thanks Justin!) because he's also an OrgMode user. You don't need to mind OrgMode right now.
</p>

<p>
Follow along if you like!
</p>
</div>
</div>
<div id="outline-container-orge6f5d8e" class="outline-2">
<h2 id="orge6f5d8e">WTF Basics</h2>
<div class="outline-text-2" id="text-orge6f5d8e">
</div>
<div id="outline-container-org8efc7f0" class="outline-3">
<h3 id="org8efc7f0">The things I won't be teaching</h3>
<div class="outline-text-3" id="text-org8efc7f0">
<p>
Before getting too deep, you should know what <a href="https://www.github.com">GitHub</a> is (<a href="https://git-scm.com/">git</a>, too), and probably have some familiarity with <a href="https://www.ruby-lang.org/en/">Ruby</a>.
Less so, you should be aware of its utilities <a href="https://rubygems.org/">Gem</a> and <a href="https://bundler.io/">Bundler</a>.
</p>

<p>
Finally, I live in a terminal, so expect very few shiny GUIs: grab your closest terminal (gnome-terminal, iTerm2, what have you) and I'll be in <a href="http://guake-project.org/index.html">Guake</a> as I normally am at any given moment in the day.
</p>

<p>
In short, this won't be your doorway into programming or computer science.
</p>
</div>
</div>

<div id="outline-container-org0e73d4e" class="outline-3">
<h3 id="org0e73d4e">Things I will be teaching</h3>
<div class="outline-text-3" id="text-org0e73d4e">
<p>
We're going to discover how to use <a href="https://pages.github.com/">GitHub pages</a> (basic cases), which is primarily driven by <a href="https://jekyllrb.com/">Jekyll</a>.
I'm going to cover the "what do you do" to "what do you get" bits, particularly the hairy first-time fool ends of it.
It works via the magic of <a href="https://github.com/features/actions">GitHub Actions</a> which (if you are not already well-versed), you should <a href="https://en.wikipedia.org/wiki/Black_box">Black box</a> as quickly as you can: things go in, magic comes out.
</p>

<p>
In order to make this apple pie from scratch, we need to first ignore the universe &#x2013; sorry, <a href="https://www.youtube.com/watch?v=7s664NsLeFM">Sagan</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org47a14e7" class="outline-2">
<h2 id="org47a14e7">Jekyll?</h2>
<div class="outline-text-2" id="text-org47a14e7">
<p>
Yes &#x2013; <a href="https://jekyllrb.com/">Jekyll</a>.
</p>

<p>
We don't need to know too much about it right now, so black box that, too. It's a magic web-page maker &#x2013; good enough.
</p>

<p>
What we do need to know is the following things I learned out of order:
</p>
<ol class="org-ol">
<li>It's <a href="https://rubygems.org/gems/jekyll">a ruby gem</a>, so we'll be in that sort of territory</li>
<li>Its themes are <a href="https://rubygems.org/search?query=jekyll-theme">also ruby gems</a>, so you'll need to install them using Gem, as well, if you'd like to test locally.</li>
<li>You don't need to test locally, but it could be nice to see what you're saying before publishing &#x2013; the <a href="https://jekyllrb.com/docs/">Jekyll docs</a> are quite friendly for helping there</li>
<li>If you fiddle with the right repository settings, GitHub will do operations on your Jekyll page for you.</li>
</ol>

<p>
Regarding #4 there, GitHub have a bunch of <a href="https://github.com/orgs/pages-themes/repositories">pages themes</a> which they will help you preview and apply once you have created your blog. But let's get that done before we go too far.
</p>
</div>
</div>

<div id="outline-container-org7bdb4be" class="outline-2">
<h2 id="org7bdb4be">GitHub Pages</h2>
<div class="outline-text-2" id="text-org7bdb4be">
<p>
GitHub have a great overview and basic tutorial (which this will supplant, skip their steps!) over at <a href="https://pages.github.com/">https://pages.github.com/</a>.
The issue is that that leave you with a pretty spartan index.html just saying "Hello world" in plain text. Ouch.
</p>

<p>
Let's &#x2026; do a bit better.
</p>
</div>

<div id="outline-container-org63814da" class="outline-3">
<h3 id="org63814da">First, how to get a web-page from GitHub</h3>
<div class="outline-text-3" id="text-org63814da">
<p>
While not all of the tutorial is super relevant, there is one bit worth quoting entirely. You can do this now or shortly, I'll remind you.
</p>
<blockquote>
<p>
<i>Head over to GitHub and create a new public repository named username.github.io, where username is your username (or organization name) on GitHub.</i>
<i>If the first part of the repository doesn’t exactly match your username, it won’t work, so make sure to get it right.</i>
</p>
</blockquote>

<p>
Let's review this a bit: you might know that GitHub serves&#x2026; well, GitHub, of course! And you might be lucky enough to know that various people have GitHub blogs or pages with their username at the front ending in `github.io`.
If you know all that &#x2013; great! If not, to summarize it again more broadly: GitHub host their own website at the address `github.com`, but they'll also host a nice looking page of your own making on a `YOUR-USERNAME.github.io` page.
If I did it right, and you aren't poking around in the source code somewhere, you're looking at one, friend!
</p>

<p>
So, in effect, you need a very specific name of the repository and it magically becomes a custom web-page on a named sub-domain.
That's a good enough black box for me! We aren't tinkering on that, so we don't need to know more.
Let's move on knowing we need to create a repository with a particular name to get a website of our own.
</p>
</div>
</div>
</div>

<div id="outline-container-org1529a34" class="outline-2">
<h2 id="org1529a34">Creating our own GitHub page</h2>
<div class="outline-text-2" id="text-org1529a34">
</div>
<div id="outline-container-orgdcebe84" class="outline-3">
<h3 id="orgdcebe84">First, the repository</h3>
<div class="outline-text-3" id="text-orgdcebe84">
<p>
If you didn't <a href="https://github.com/new">create a new repository</a> named `YOUR-USERNAME.github.io` (please replace your actual username where implied, of course), then go ahead and do that now.
You don't need any fancy settings &#x2013; just leave everything as it was when you arrived and fill out the name, a "click next, next, next, done" sort of thing.
We only care to change what highlights in red if we ignore everything and hit next.
</p>

<p>
Clone that new repo down and and, "hooray?" &#x2013; it's empty.
</p>
</div>
</div>

<div id="outline-container-orgdeba538" class="outline-3">
<h3 id="orgdeba538">Next, <code>bundler</code> and jekyll</h3>
<div class="outline-text-3" id="text-orgdeba538">
<p>
Originally, I ran `bundle init` and tried adding Jekyll as a gem, but that's not the best way of bootstrapping this project.
Hopefully you got Jekyll installed above. If not, go complete the steps at the <a href="https://jekyllrb.com/docs/">Jekyll docs</a>. We'll need it before proceeding.
</p>

<p>
Jekyll will be quite a bit wiser in setting things up if we go directly to it.
</p>

<p>
In your terminal, change to the directory you have cloned down and run: `jekyll new .`
</p>

<p>
The period is not a typo here, we are telling Jekyll to create the blog at this site.
(Technically, you could have also skipped `cd`ing into the directory and just pointed at it, but why so stand-off-ish? Let's get in there!)
</p>

<p>
You should now have a Jekyll site. Let's test that theory!
</p>

<p>
`bundle exec jekyll serve`!
</p>

<p>
(pro-tip: we put `bundle exec` first so that we get the right version of Jekyll)
</p>
</div>
</div>

<div id="outline-container-org7797d06" class="outline-3">
<h3 id="org7797d06">Who the heck is a webrick and why is he upset?</h3>
<div class="outline-text-3" id="text-org7797d06">
<p>
So, if your experiment is anything like mine (i.e. running on ruby 3 or greater). You may be greeted by this displeasing error output:
</p>
<pre class="example">
Configuration file: /tmp/tmp.qBw39uHlX2/_config.yml
            Source: /tmp/tmp.qBw39uHlX2
       Destination: /tmp/tmp.qBw39uHlX2/_site
 Incremental build: disabled. Enable with --incremental
      Generating... 
       Jekyll Feed: Generating feed for posts
                    done in 0.357 seconds.
 Auto-regeneration: enabled for '/tmp/tmp.qBw39uHlX2'
                    ------------------------------------------------
      Jekyll 4.2.2   Please append `--trace` to the `serve` command 
                     for any additional information or backtrace. 
                    ------------------------------------------------
/home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/commands/serve/servlet.rb:3:in `require': cannot load such file -- webrick (LoadError)
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/commands/serve/servlet.rb:3:in `&lt;top (required)&gt;'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/commands/serve.rb:179:in `require_relative'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/commands/serve.rb:179:in `setup'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/commands/serve.rb:100:in `process'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/command.rb:91:in `block in process_with_graceful_fail'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/command.rb:91:in `each'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/command.rb:91:in `process_with_graceful_fail'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/lib/jekyll/commands/serve.rb:86:in `block (2 levels) in init_with_program'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/mercenary-0.4.0/lib/mercenary/command.rb:221:in `block in execute'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/mercenary-0.4.0/lib/mercenary/command.rb:221:in `each'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/mercenary-0.4.0/lib/mercenary/command.rb:221:in `execute'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/mercenary-0.4.0/lib/mercenary/program.rb:44:in `go'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/mercenary-0.4.0/lib/mercenary.rb:21:in `program'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/gems/jekyll-4.2.2/exe/jekyll:15:in `&lt;top (required)&gt;'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/bin/jekyll:23:in `load'
        from /home/nicholas/.rvm/gems/ruby-3.0.0/bin/jekyll:23:in `&lt;main&gt;'
</pre>

<p>
As always, type some of this into Google and <a href="https://stackoverflow.com/questions/65989040/bundle-exec-jekyll-serve-cannot-load-such-file">'lo</a> - there is a StackOverflow answer where folks have seen this exact error.
The joys of computer programming &#x2013; our Ruby is too new and the folks at Jekyll clearly haven't pinned down quite why or where webrick is or is not needed, so they let us enjoy the pains of figuring it out.
</p>

<p>
Not a perfect #DX moment, but let's move on.
Slam `gem "webrick"` unceremoniously into your Gemfile under the `gem "jekyll"` line, learning literally nothing about it, run `bundle` again (which implies `bundle install`; less typing is better typing!), and prepare for more fanfare with less <a href="https://sadtrombone.com/">sad trombone</a>!
</p>

<p>
Ta-da!
</p>

<pre class="example">
Configuration file: /tmp/tmp.qBw39uHlX2/_config.yml
            Source: /tmp/tmp.qBw39uHlX2
       Destination: /tmp/tmp.qBw39uHlX2/_site
 Incremental build: disabled. Enable with --incremental
      Generating... 
       Jekyll Feed: Generating feed for posts
                    done in 0.337 seconds.
 Auto-regeneration: enabled for '/tmp/tmp.qBw39uHlX2'
    Server address: http://127.0.0.1:4000/
  Server running... press ctrl-c to stop.
</pre>

<p>
&#x2026; It would be really nice if these sorts of programs could automagically call `xdg-open <a href="http://127.0.0.1:4000">http://127.0.0.1:4000</a>`, too, but that's a bit preferential.
Open that web-page (you should be able to click what I just typed) and witness your marvel!
</p>
</div>
</div>

<div id="outline-container-org97d4926" class="outline-3">
<h3 id="org97d4926">Uh, it didn't work</h3>
<div class="outline-text-3" id="text-org97d4926">
<p>
Yeah, it didn't work for me, either.
If it <b>did</b> work for you, just carry on.
If it didn't however, try just picking up from the last verse and singing it again:
</p>

<pre class="example">
$ bundle exec jekyll new . --force
$ vim Gemfile # add in webrick again
$ bundle
$ bundle exec jekyll serve
</pre>

<p>
I ran this sort of flow a couple times to fix some things I borked while experimenting. No shame in experimenting! Humpty-dumpty, however, must go back together again.
We have just set all this up so we aren't really attached to it. By ploughing over what goofs we made and sticking to the script, we should be able to reach our "ta-da" moment shortly.
</p>

<p>
If so, hooray! If not&#x2026; the student now becomes the teacher: begin googling and @me with your updated blog!
</p>

<p>
(p.s. in my case, it was that I was trying to set a different theme in `<sub>config.yml</sub>` too early in the game before even getting things running and it was causing build errors)
</p>
</div>
</div>

<div id="outline-container-org3b06ff0" class="outline-3">
<h3 id="org3b06ff0">Uploading</h3>
<div class="outline-text-3" id="text-org3b06ff0">
<p>
Once you see a pretty site, it's time to add all those files, commit them, push and watch the magic happen on GitHub!
It won't be instantaneous. Go to the "Actions" tab and make sure the build completes successfully. Otherwise, you'll need to debug it!
</p>

<p>
If all succeeds, head to `YOUR-USER.github.io` and - boom! - you're a blogger!
</p>
</div>
</div>
</div>

<div id="outline-container-orgec211c6" class="outline-2">
<h2 id="orgec211c6">What's next?</h2>
<div class="outline-text-2" id="text-orgec211c6">
<p>
Well, actually blogging for one.
We bootstrapped in, but this is very "not ours" and we would like it to be "even somewhat ours".
Next time, we may talk about making posts or something as such.
</p>

<p>
Maybe! Try it without me, first!
</p>
</div>
</div>
